# Задание №2
list = [1,2,3,4,5,6,7,8,9,10]
num = int(input('Введите число:'))
del list[3]
list.insert(3,num)
print(list)