# Задание №1
print('Введите пароль') 
a = input()
b = input()
if a == b:
    print('Успешно')
else:
    print('Ошибка')