# Задание №1
print('Введите пароль')
name1 = input()
name2 = input()
if name1 == name2:
    print('Пароль верный')
else:
    print('Пароль неверный')